# a = input("Введите число: ")
# print(int(a) * 5)
# print(a * 5)

# a = int(input("Введите число: "))
# print(int(a) * 5)
# print(a * 5)

# comment

"""
comment
comment
"""

# Выделение
# ctrl + /
# ctrl + k -> ctrl + c
# ctrl + k -> ctrl + u

# 7 / 5 = 1,4 - обычное деление
# 7 // 5 = 1 (остаток 2) -> 1  (целочисленное)
# 7 % 5 = 1 (остаток 2) -> 2  получаем остаток.


# Task1. За день машина проезжает n километров. 
# Сколько дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя
# пользоваться условной инструкцией if и циклами.

# Input:
# n = 700
# m = 750

# Output:
# 2

# n = int(input('Введите число: '))
# m = int(input('Введите число: '))
# print(m // n + int(m % n > 0))
